packages/workdo/CollaborativeServices/src/Providers/ViewComposer.php

            {
                $slug = frontend_bussiness_slug();
            }
            $business = Business::where('slug', $slug)->first();
---
select * from `businesses` where `slug` = 'xtream_exhaust' limit 1