packages/workdo/PromoCodes/src/Providers/ViewComposer.php

select * from `businesses` where `slug` = 'xtream_exhaust' limit 1
---
    public function boot()
    {
        view()->composer(['web_layouts.appointment-form', 'form_layout.*.index'], function ($view)
        {
            $request = Request::instance();
            $slug = $request->segment(2);
            if(!$slug)
            {
                $slug = frontend_bussiness_slug();
            }
            $business = Business::where('slug', $slug)->first();