app/Helper/helper.php

    function getAdminAllSetting()
    {
        // Laravel cache
        return Cache::rememberForever('admin_settings', function () {
            $super_admin = User::where('type', 'super admin')->first();
            $settings = [];
            if ($super_admin) {
                $settings = Setting::where('created_by', $super_admin->id)->where('business', $super_admin->active_business)->pluck('value', 'key')->toArray();
            }

            return $settings;
        });
---
select `value`, `key` from `settings` where `created_by` = 1 and `business` = 0
select * from `users` where `type` = 'super admin' limit 1

    function getCompanyAllSetting($user_id = null, $business = null)
    {
        if (!empty($user_id)) {
            $user = User::find($user_id);
---
select * from `users` where `users`.`id` = 16 limit 1

    function getBusiness()
    {
        $data = [];
        if (Auth::check()) {
            static $users = null;
            if ($users == null) {
                $users = User::where('email', Auth::user()->email)->get();
---
select * from `users` where `email` = 'sales@xtremeexhaust.com.au'

    function module_is_active($module, $user_id = null)
    {
        if (Module::has($module)) {
            $isModuleActive = Module::isEnabled($module);
            if ($isModuleActive == false) {
                return false;
            }
            if (Auth::check()) {
                $user = Auth::user();
            } elseif ($user_id != null) {
                $user = User::find($user_id);
---
select * from `users` where `users`.`id` = 16 limit 1

    function ActivatedModule($user_id = null)
    {
        $activated_module = user::$superadmin_activated_module;

        if ($user_id != null) {
            $user = User::find($user_id);
---
select * from `users` where `users`.`id` = 16 limit 1

    function PlanCheck($type = 'User', $id = null)
    {
        if (!empty($id)) {
            $user = User::where('id', $id)->first();
---
select * from `users` where `id` = 16 limit 1

        }
        if ($type == "Business") {
            if ($user->total_business >= 0) {
                $business = Business::where('created_by', $id)->get();
---
select * from `businesses` where `created_by` = 16

    function timeSlot($serviceId = null, $date = null, $flexibleData = null,$service_data = null,$staff_id = null, $duration = null)
    {
        $service = Service::find($serviceId);
        $company_settings = getCompanyAllSetting($service->created_by, $service->business_id);
        $maximum_slot = isset($company_settings['maximum_slot']) ? $company_settings['maximum_slot'] : '1';

        if ($date && !empty($service)) {
            $booked_appointment = Appointment::where('service_id', $serviceId)->where('date', $date)->where('business_id', $service->business_id)->where('staff_id', $staff_id)->where('created_by', $service->created_by)->select('time')->get()->toArray();

            $selectedDate = Carbon::createFromFormat('d-m-Y', $date);
            $dayName = $selectedDate->format('l');                              //get dayname using date

            $businessday = BusinessHours::where('created_by', $service->created_by)->where('business_id', $service->business_id)->where('day_name', $dayName)->first();
---
select * from `services` where `services`.`id` = '31' limit 1
select `time` from `appointments` where `service_id` = '31' and `date` = '03-08-2026' and `business_id` = 3 and `staff_id` is null and `created_by` = 16
select * from `business_hours` where `created_by` = 16 and `business_id` = 3 and `day_name` = 'Monday' limit 1