app/Http/Controllers/AppointmentController.php

    public function create()
    {
        if (Auth::user()->isAbleTo('appointment create')) {
            $location = Location::where('created_by', creatorId())->where('business_id', getActiveBusiness())->select('name', 'id')->get()->prepend(['id' => null, 'name' => 'Select Location'])->pluck('name', 'id');

            $service = Service::where('created_by', creatorId())->where('business_id', getActiveBusiness())->select('name', 'id')->get()->prepend(['id' => null, 'name' => 'Select Service'])->pluck('name', 'id');

            $customer = Customer::where('created_by', creatorId())->where('business_id', getActiveBusiness())->get()->pluck('name', 'user_id')->prepend('select customer');


            $staff = Staff::where('created_by', creatorId())->where('business_id', getActiveBusiness())->select('name', 'user_id')->get()->prepend(['user_id' => null, 'name' => 'Select Staff'])->pluck('name', 'user_id');


            $customer = User::where('created_by', creatorId())
                ->where('business_id', getActiveBusiness())
                ->where('type', 'customer')
                ->select('name', 'id', 'mobile_no')
                ->get()
                ->mapWithKeys(function ($item) {
                    return [
                        $item->id => $item->name . ' (' . $item->mobile_no . ')'
                    ];
                })
                ->prepend('Select Customer', null);


            $busineshours = BusinessHours::where('created_by', creatorId())
                ->where('business_id', getActiveBusiness())
                ->where('day_off', 'on')
                ->select('day_name')
                ->get()
                ->pluck('day_name')
                ->map(function ($day) {
                    return date('w', strtotime($day));
                })
                ->toArray();

            $businesholiday = BusinessHoliday::where('created_by', creatorId())
                ->where('business_id', getActiveBusiness())
                ->pluck('date')
                ->map(function ($date) {
                    return Carbon::parse($date)->format('d-m-Y');
                })
                ->toArray();
---
select `name`, `id` from `locations` where `created_by` = 16 and `business_id` = 3
select `name`, `id` from `services` where `created_by` = 16 and `business_id` = 3
select `name`, `user_id` from `staff` where `created_by` = 16 and `business_id` = 3
select `day_name` from `business_hours` where `created_by` = 16 and `business_id` = 3 and `day_off` = 'on'
select `date` from `business_holidays` where `created_by` = 16 and `business_id` = 3