app/Http/Controllers/BookingV2Controller.php

    public function calendar(Request $request)
    {
        if (!Auth::user()->isAbleTo('appointment manage')) {
            return redirect()->back()->with('error', __('Permission denied.'));
        }

        $businessId = getActiveBusiness();
        $createdBy = creatorId();

        $locations = Location::where('business_id', $businessId)
            ->where('created_by', $createdBy)
            ->orderBy('name')
            ->pluck('name', 'id');

        // Shaped here rather than in the view: the panel's status <select> only
        // needs id and title.
        $statuses = CustomStatus::where('business_id', $businessId)
            ->where('created_by', $createdBy)
            ->orderBy('id')
            ->get()
            ->map(function ($status) {
                return ['id' => $status->id, 'title' => $status->title];
            })
            ->values();

        // Extra entries for the staff-mode picker, so a single column can be isolated.
        $staffOptions = Staff::where('business_id', $businessId)
            ->where('created_by', $createdBy)
            ->orderBy('name')
            ->pluck('name', 'user_id');
---
select `name`, `id` from `locations` where `business_id` = 3 and `created_by` = 16 order by `name` asc
select * from `custom_statuses` where `business_id` = 3 and `created_by` = 16 order by `id` asc
select `name`, `user_id` from `staff` where `business_id` = 3 and `created_by` = 16 order by `name` asc

    public function staffs(Request $request)
    {
        if (!Auth::user()->isAbleTo('appointment manage')) {
            return response()->json([], 403);
        }

        $businessId = getActiveBusiness();
        $createdBy = creatorId();

        $date = $this->parseRequestDate($request->input('date')) ?? Carbon::today();
        $locationId = $request->input('location_id');
        $mode = $request->input('staff_id', 'roster');

        $allStaff = Staff::where('business_id', $businessId)
            ->where('created_by', $createdBy)
            ->get();
---
select * from `staff` where `business_id` = 3 and `created_by` = 16

    public function getAppointment($id)
    {
        if (!Auth::user()->isAbleTo('appointment manage')) {
            return response()->json(['error' => __('Permission denied.')], 403);
        }

        $appointment = Appointment::with(['ServiceData', 'CustomerData', 'StatusData', 'StaffData', 'LocationData', 'payment', 'jobCard.files'])
            ->where('business_id', getActiveBusiness())
            ->where('created_by', creatorId())
            ->find($id);
---
select * from `appointments` where `business_id` = 3 and `created_by` = 16 and `appointments`.`id` = '412' limit 1