app/Http/Controllers/HomeController.php

select * from `settings` where `key` = 'domains' and `value` = '15.134.19.107' limit 1
---

                        // remove WWW
                        $remote = str_replace('www.', '', $remote);
                        $domain = Setting::where('key', '=', 'domains')->where('value', '=', $remote)->first();

select * from `settings` where `key` = 'subdomain' and `value` = '15.134.19.107' limit 1
---
                                $business = Business::find($enable_domain->business);
                            }
                        }
                        $sub_domain = Setting::where('key', '=', 'subdomain')->where('value', '=', $remote)->first();