app/Http/Controllers/StaffController.php

select * from `staff` where FIND_IN_SET(31, service_id) > 0 and FIND_IN_SET(3, location_id) > 0
---
    public function destroy(Staff $staff)
    {
        if(Auth::user()->isAbleTo('staff delete'))
        {
            $user = User::find($staff->user_id);
            if($user)
            {
                if(!empty($user->avatar))
                {
                    delete_file($user->avatar);
                }
                $user->delete();
                $staff->delete();
            }
            $tab = 3;
            return redirect()->back()->with('error', __('Staff successfully delete.'))->with('tab', $tab);

select * from `users` where `users`.`id` in (21, 22, 30, 31)
---
    public function getStaffData(Request $request)
    {
        if (!empty($request->service) && !empty($request->location)) {
            $serviceId = $request->service;
            $locationId = $request->location;
            $date = $request->date;
            $staffData = Staff::with('user')->whereRaw("FIND_IN_SET(?, service_id) > 0", [$serviceId])
                ->whereHas('locations', function ($query) use ($locationId) {
                    $query->where('locations.id', $locationId);
                })
                ->get();