app/Models/Business.php

select * from `businesses` where `slug` = 'xtream_exhaust' limit 1
---
    public static function pwa_business($slug)
    {
        $business = Business::where('slug',$slug)->first();